package random

import (
	"fmt"
	"math/rand"

	"github.com/recruit-tech/RISUCON2022Summer/bench/model"
)

var (
	firstNameList = []string{
		"正一", "清", "正雄", "正", "茂", "武雄", "正治", "三郎", "正夫", "一郎", "正二", "義雄", "正男", "正三", "勇", "実", "秀雄", "辰雄", "辰男", "博", "弘", "進", "武", "一男", "昭二", "昭", "和夫", "昭一", "昭三", "幸雄", "稔", "明", "昇", "隆", "勉", "勝", "勲", "功", "勝利", "修", "豊", "誠", "浩", "徹", "浩一", "浩二", "浩之", "聡", "剛", "和彦", "秀樹", "哲也", "直樹", "達也", "学", "健一", "淳", "健", "博之", "英樹", "崇", "大輔", "大介", "亮", "竜也", "健太郎", "洋平", "健太", "和也", "翔", "拓也", "祐介", "雄太", "優", "翔太", "大樹", "翔平", "駿", "大貴", "貴大", "大輝", "翼", "-", "大地", "亮太", "拓哉", "雄大", "拓海", "直人", "康平", "陸", "海斗", "一輝", "涼太", "匠", "智也", "蓮", "優斗", "竜", "優太", "颯太", "大翔", "太陽", "悠斗", "颯", "輝", "大和", "空", "陽斗", "悠希", "陽向", "悠人", "悠太", "瑛太", "悠真", "颯真", "歩夢", "蒼空", "大雅", "樹", "陽翔", "陸斗", "太一", "海翔", "湊", "龍生", "陽太", "朝陽", "結翔", "悠翔", "悠", "新", "葵", "蒼", "陽大", "律",
		"千代", "ハル", "ハナ", "正子", "文子", "ヨシ", "千代子", "キヨ", "静子", "はる", "フミ", "マサ", "きみ", "きよ", "キミ", "トミ", "光子", "清子", "八重子", "貞子", "愛子", "美代子", "久子", "和子", "芳子", "君子", "幸子", "敏子", "信子", "照子", "昭子", "節子", "典子", "孝子", "美智子", "洋子", "弘子", "栄子", "良子", "京子", "悦子", "紀子", "恵子", "勝子", "恵美子", "啓子", "久美子", "順子", "由美子", "裕子", "明美", "智子", "浩子", "真由美", "由美", "ゆかり", "直美", "陽子", "直子", "純子", "恵美", "美香", "香織", "恵", "美穂", "優子", "美紀", "裕美", "めぐみ", "理恵", "愛", "絵美", "麻美", "麻衣", "明日香", "智美", "麻衣子", "友美", "彩", "あゆみ", "舞", "由佳", "愛美", "沙織", "成美", "瞳", "彩香", "-", "千尋", "美咲", "早紀", "茜", "桃子", "里奈", "萌", "彩花", "遥", "千夏", "葵", "佳奈", "菜摘", "真由", "楓", "奈々", "優花", "七海", "未来", "彩乃", "玲奈", "亜美", "菜々子", "さくら", "菜月", "美月", "詩織", "彩夏", "未 来", "結衣", "琴音", "美羽", "莉子", "美優", "凜", "陽菜", "真央", "花音", "百花", "ひなた", "優衣", "杏", "結菜", "優奈", "心優", "美桜", "結愛", "愛莉", "杏奈", "心愛", "愛菜", "心春", "芽依", "美結", "心咲", "凛", "陽葵", "桜", "愛梨", "花", "心結", "咲良", "結月", "紬", "詩", "澪", "紬希",
	}
	lastNameList = []string{
		"佐藤", "鈴木", "高橋", "田中", "伊藤", "渡辺", "山本", "中村", "小林", "加藤", "吉田", "山田", "佐々木", "山口", "松本", "井上", "木村", "林", "斎藤", "清水", "山崎", "森", "池田", "橋本", "阿部", "石川", "山下", "中島", "石井", "小川", "前田", "岡田", "長谷川", "藤田", "後藤", "近藤", "村上", "遠藤", "青木", "坂本", "斉藤", "福田", "太田", "西村", "藤井", "金子", "岡本", "藤原", "中野", "三浦", "原田", "中川", "松田", "竹内", "小野", "田村", "中山", "和田", "石田", "森田", "上田", "原", "内田", "柴田", "酒井", "宮崎", "横山", "高木", "安藤", "宮本", "大野", "小島", "谷口", "今井", "工藤", "高田", "増田", "丸山", "杉山", "村田", "大塚", "新井", "小山", "平野", "藤本", "河野", "上野", "野口", "武田", "松井", "千葉", "岩崎", "菅原", "木下", "久保", "佐野", "野村", "松尾", "市川", "菊地", "杉本", "古川", "大西", "島田", "水野", "桜井", "高野", "渡部", "吉川", "山内", "西田", "飯田", "菊池", "西川", "小松", "北村", "安田", "五十嵐", "川口", "平田", "関", "中田", "久保田", "服部", "東", "岩田", "土屋", "川崎", "福島", "本田", "辻", "樋口", "秋山", "田口", "永井", "山中", "中西", "吉村", "川上", "石原", "大橋", "松岡", "馬場", "浜田", "森本", "星野", "矢野", "浅野", "大久保", "松下", "吉岡", "小池", "野田", "荒木", "大谷", "内藤", "松浦", "熊谷", "黒田", "尾崎", "永田", "川村", "望月", "田辺", "松村", "荒井", "堀", "大島", "平井", "早川", "菅野", "栗原", "西山", "広瀬", "横田", "石橋", "萩原", "岩本", "片山", "関口", "宮田", "大石", "高山", "本間", "吉野", "須藤", "岡崎", "小田", "伊東", "鎌田", "上原", "篠原", "小西", "松原", "福井", "古賀", "大森", "小泉", "成田", "南", "奥村", "内山", "沢田", "川島", "桑原", "三宅", "片岡", "富田", "杉浦", "岡", "八木", "奥田", "小沢", "松永", "北川", "関根", "河合", "平山", "牧野", "白石", "今村", "寺田", "青山", "中尾", "小倉", "渋谷", "上村", "小野寺", "大山", "足立", "岡村", "坂口", "天野", "多田", "佐久間", "根本", "豊田", "田島", "飯塚", "角田", "村山", "武藤", "西", "白井", "竹田", "宮下", "塚本", "榎本", "神谷", "坂田", "児玉", "水谷", "坂井", "齋藤", "小原", "浅井", "岡部", "森下", "小笠原", "神田", "中井", "植田", "河村", "宮川", "稲垣", "前川", "大川", "松崎", "長田", "若林", "飯島", "谷", "大沢", "石塚", "安部", "堀内", "及川", "田代", "中嶋", "江口", "山根", "中谷", "岸本", "荒川", "本多", "西尾", "森山", "岡野", "金井", "細川", "今野", "戸田", "稲葉", "安達", "津田", "森川", "落合", "土井", "村松", "星", "町田", "三上", "畠山", "岩井", "長尾", "堤", "中原", "野崎", "中沢", "金田", "米田", "松山", "杉田", "堀田", "西野", "三好", "山岸", "佐伯", "黒川", "西岡", "泉", "大竹", "甲斐", "笠原", "大木", "堀江", "岸", "徳永", "川田", "須田", "黒木", "山川", "古田", "榊原", "梅田", "新田", "三木", "野中", "大城", "村井", "奥山", "金城", "土田", "滝沢", "大村", "川端", "井口", "梶原", "大場", "宮城", "長島", "比嘉", "吉原", "宮内", "金沢", "安井", "庄司", "大内", "茂木", "荻野", "日高", "松島", "向井", "下田", "塚田", "石黒", "西本", "奥野", "竹中", "広田", "嶋田", "栗田", "藤川", "福本", "北野", "宇野", "藤野", "川原", "谷川", "丹羽", "小谷", "吉本", "青柳", "藤岡", "竹本", "竹下", "古谷", "緒方", "藤村", "平川", "亀井", "高島", "三輪", "藤沢", "篠崎", "窪田", "宮原", "高井", "根岸", "下村", "高瀬", "山村", "川本", "柳沢", "横井", "小澤", "出口", "吉沢", "武井", "小森", "竹村", "長野", "宮沢", "志村", "平松", "臼井", "福岡", "黒沢", "溝口", "田原", "稲田", "浅田", "筒井", "柳田", "奧村", "大原", "永野", "林田", "冨田", "大平", "瀬戸", "手塚", "入江", "篠田", "福永", "北原", "富永", "矢島", "小出", "湯浅", "鶴田", "沼田", "高松", "長岡", "堀口", "岩瀬", "山岡", "大田", "石崎", "大槻", "澤田", "石山", "池上", "堀川", "二宮", "相馬", "園田", "柏木", "島崎", "奧田", "平岡", "花田", "杉原", "加納", "村瀬", "川野", "片桐", "内海", "長沢", "倉田", "野沢", "河原", "福原", "秋元", "越智", "西原", "松野", "笠井", "小坂", "田畑", "日野", "北島", "渡邊", "谷本", "千田", "吉井", "深沢", "西沢", "相沢", "徳田", "原口", "小柳", "米山", "新谷", "細谷", "田上", "今泉", "菅", "浜野", "森岡",
	}
)

func username() string {
	firstName := firstNameList[rand.Intn(len(firstNameList))]
	lastName := lastNameList[rand.Intn(len(lastNameList))]
	return fmt.Sprintf("%s %s", lastName, firstName)
}

// User generate random User.
// ID field is empty string because ID is decided by the webapp server.
func User() *model.User {
	return &model.User{
		ID:       "",
		Name:     username(),
		Email:    fmt.Sprintf("%s@rcal.com", ID()),
		Password: ID(),
	}
}

func Team() *model.Team {
	return model.NewTeam(fmt.Sprintf("Team %s", ID()))
}
